; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v2)
		(pred_2 ?v4)
		(pred_4 ?v1)
		(pred_6 ?v1)
		(pred_1 ?v4 ?v1)
		(pred_3)
		(pred_5 ?v4))

   (:action op_3
       :parameters  (?v7 ?v6)
       :precondition (and (not-eq ?v7 ?v6) 
                          (pred_4 ?v7) (pred_4 ?v6) (pred_6 ?v7))
       :effect (and  (pred_6 ?v6)
		     (not (pred_6 ?v7))))


   (:action op_1
       :parameters (?v5 ?v3)
       :precondition  (and  (pred_2 ?v5) (pred_4 ?v3)
			    (pred_1 ?v5 ?v3) (pred_6 ?v3) (pred_3))
       :effect (and (pred_5 ?v5)
		    (not (pred_1 ?v5 ?v3)) 
		    (not (pred_3))))

   (:action op_2
       :parameters  (?v5  ?v3)
       :precondition  (and  (pred_2 ?v5) (pred_4 ?v3)
			    (pred_5 ?v5) (pred_6 ?v3))
       :effect (and (pred_1 ?v5 ?v3)
		    (pred_3)
		    (not (pred_5 ?v5)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_02 obj_03 obj_01 
          obj_05 obj_06 obj_04 
)
(:init
(pred_4 obj_02)
(pred_4 obj_03)
(pred_4 obj_01)
(pred_2 obj_05)
(pred_2 obj_06)
(pred_2 obj_04)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(pred_3)
(pred_1 obj_05 obj_03)
(pred_1 obj_06 obj_02)
(pred_1 obj_04 obj_03)
(pred_6 obj_03)
)
(:goal
(and
(pred_1 obj_05 obj_02)
(pred_1 obj_06 obj_01)
(pred_1 obj_04 obj_02)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_05 obj_02) (pred_6 obj_01))
    (sometime-before  (pred_1 obj_06 obj_01) (pred_6 obj_03))
    (sometime-before  (pred_1 obj_04 obj_02) (pred_6 obj_01))
  )
)
)

; plan
1. (op_1 obj_04 obj_03)
   deleted: (pred_1 obj_04 obj_03) (pred_3)
   added: (pred_5 obj_04)
   goals met: 0 of 3
2. (op_3 obj_03 obj_01)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_01)
   goals met: 0 of 3
3. (op_2 obj_04 obj_01)
   deleted: (pred_5 obj_04)
   added: (pred_1 obj_04 obj_01) (pred_3)
   goals met: 0 of 3
4. (op_3 obj_01 obj_03)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_03)
   goals met: 0 of 3
5. (op_1 obj_05 obj_03)
   deleted: (pred_1 obj_05 obj_03) (pred_3)
   added: (pred_5 obj_05)
   goals met: 0 of 3
6. (op_3 obj_03 obj_02)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_02)
   goals met: 0 of 3
7. (op_2 obj_05 obj_02)
   deleted: (pred_5 obj_05)
   added: (pred_1 obj_05 obj_02) (pred_3)
   goals met: 1 of 3
8. (op_1 obj_06 obj_02)
   deleted: (pred_1 obj_06 obj_02) (pred_3)
   added: (pred_5 obj_06)
   goals met: 1 of 3
9. (op_3 obj_02 obj_01)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_01)
   goals met: 1 of 3
10. (op_2 obj_06 obj_01)
   deleted: (pred_5 obj_06)
   added: (pred_1 obj_06 obj_01) (pred_3)
   goals met: 2 of 3
11. (op_1 obj_04 obj_01)
   deleted: (pred_1 obj_04 obj_01) (pred_3)
   added: (pred_5 obj_04)
   goals met: 2 of 3
12. (op_3 obj_01 obj_02)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_02)
   goals met: 2 of 3
13. (op_2 obj_04 obj_02)
   deleted: (pred_5 obj_04)
   added: (pred_1 obj_04 obj_02) (pred_3)
   goals met: 3 of 3
